// --------------------------------------------------------------------------------------------------------------
// A.M. Tykvinsky , 04.02.2021
// --------------------------------------------------------------------------------------------------------------
// ТАЙМЕРЫ
// --------------------------------------------------------------------------------------------------------------

#ifndef _TIMERS_HPP
#define _TIMERS_HPP

// 

class timers
{
	
private:

	double   m_Time;              // счетчик времени, секунды
	double   m_Fs;               // частота дискретизации, √ц
	double   m_Ts;              // период дискретизации, с
	int     m_FramesPerCycle; // к - во точек в полубуфере
	bool    m_Q;             // выходна¤ переменна¤
	bool    m_CC;
	bool    m_QQ;
	
public:

	// конструктор:
	timers();

	// деструктор:
	~timers();

	// функция инициализации блока TON:
	int Init( double Fs, int FramesPerCycle );

	// функции отсчета выдержек времени:
	int ton( bool in , double dT); // таймер на фронт
	int tof( bool in , double dT); // таймер на спад
	int tp ( bool in , double dT); // импульс

	// получить значение выхода:
	bool getState();

	//
	double getTime();

};

#endif 


